app/views/posts/_post.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	<% if user_signed_in? && current_user != post.user %>
	  <% if current_user.following_user.include?(post.user) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 7]]
---
	</div> <div class="card-action">
	<%= post.likes.size %> 人の

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---

	<% if post.comments.present? %>
	<ul class="collection">
		<% post.comments.each do |comment| %>