app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 3], ["content", "Test2\r\nTest3"], ["created_at", "2021-02-18 03:41:56.989507"], ["updated_at", "2021-02-18 03:41:56.989507"]]
---
	def create
		new_comment = Comment.new(content: params[:content],
								  post_id: params[:post_id],
								  user_id: current_user.id)
		new_comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@comment = Comment.find_by(id: params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "コメント機能の\r\n修正をテスト中です。\r\n"], ["updated_at", "2021-02-18 05:12:08.008734"], ["id", 3]]
---
	def update
		@comment = Comment.find_by(id: params[:id])

		@comment.content = params[:content]

		if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def check_ownership!
		@comment = Comment.find_by(id: params[:id])