app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 3], ["created_at", "2021-02-18 02:49:45.869393"], ["updated_at", "2021-02-18 02:49:45.869393"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
	def like_toggle
		like = Like.find_by(user_id: current_user.id,
							post_id: params[:post_id])
		if like.nil?
			Like.create(user_id: current_user.id,
						post_id: params[:post_id])
		else
			like.destroy