app/controllers/posts_controller.rb

  def index
	  @posts = Post.all.order('created_at desc')
	  @posts_count = current_user.posts.length
---
SELECT "posts".* FROM "posts" ORDER BY created_at desc
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

  def create
	  new_post = Post.new(user_id: current_user.id,
		  				  content: params[:content],
		  				  imige: params[:imige])
	  if new_post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "imige") VALUES (?, ?, ?, ?, ?)  [["content", "asdf"], ["user_id", 1], ["created_at", "2021-02-22 02:34:19.608410"], ["updated_at", "2021-02-22 02:34:19.608410"], ["imige", "U2.jpg"]]

  def update
	  @post.content = params[:content]
	  if @post.save
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Second Post\r\nEditing post"], ["updated_at", "2021-02-18 01:30:26.677173"], ["id", 4]]

  def check_ownership
	  @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]