app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 2], ["created_at", "2021-02-19 06:17:11.134924"], ["updated_at", "2021-02-19 06:17:11.134924"]]
---
	def create
		Relationship.create(followed_id: params[:followed_id],
							follower_id: current_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 4]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = ? LIMIT ?  [["follower_id", 2], ["LIMIT", 1]]
---
	def destroy
		Relationship.find_by(follower_id: current_user.id).destroy