app/models/user.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 2], ["LIMIT", 1]]
---
  def is_like?(post)
	  Like.find_by(user_id: self.id, post_id: post.id).present?